Revit 2027 API
SiteSubRegion.IsValidBoundary Method
 Identifies whether the given curve loops compose a valid boundary.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidBoundary(
	IList<CurveLoop> curveLoops
)
Public Shared Function IsValidBoundary (
	curveLoops As IList(Of CurveLoop)
) As Boolean
public:
static bool IsValidBoundary(
	IList<CurveLoop^>^ curveLoops
)
static member IsValidBoundary :
        curveLoops : IList<CurveLoop> -> bool
Parameters
curveLoops IList<CurveLoop>
 The curve loops to be checked.
Return Value
Boolean
 True if the given curve loops don't intersect with each other; each curve loop is closed; and each loop is planar and lies on a plane parallel to the horizontal(XY) plane. Any requirement above is not satisfied or no curve loops contained, returns false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The curve loops are valid if they don't intersect with each other; each curve loop is closed; and each loop is planar and lies on a plane parallel to the horizontal(XY) plane.
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace